#Транслитерация
#Написать программу для транслитерации фамилии, имени, отчества для загранпаспорта по установленным МВД РФ требованиям:
#А (а) -> A (a)   Ж (ж) -> Zh (zh)    Н (н) -> N (n)   Ф (ф) -> F (f)        Ъ (ъ) -> Ie (ie)  
#Б (б) -> B (b)   З (з) -> Z (z)      О (о) -> O (o)   Х (х) -> Kh (kh)      Э (э) -> E (e)  
#В (в) -> V (v)   И (и) -> I (i)      П (п) -> P (p)   Ц (ц) -> Ts (ts)      Ю (ю) -> Iu (iu)  
#Г (г) -> G (g)   Й (й) -> I (i)      Р (р) -> R (r)   Ч (ч) -> Ch (ch)      Я (я) -> Ia (ia)  
#Д (д) -> D (d)   К (к) -> K (k)      С (с) -> S (s)   Ш (ш) -> Sh (sh)      ь     -> не пишется  
#Е (е) -> E (e)   Л (л) -> L (l)      Т (т) -> T (t)   Щ (щ) -> Shch (shch)  
#Ё (ё) -> E (e)   М (м) -> M (m)      У (у) -> U (u)   Ы (ы) -> Y (y)
#Формат ввода
#Попов Василий Вячеславович
#Формат вывода
#Popov Vasilii Viacheslavovich

#создать словарь
trans_dict = {"А":"A","а":"a","Б":"B","б":"b","В":"V","в":"v","Г":"G","г":"g","Д":"D","д":"d",
        "Е":"E","е":"e","Ё":"E","ё":"e","Ж":"Zh","ж":"zh","З":"Z","з":"z","И":"I","и":"i",
        "Й":"i","й":"i","К":"K","к":"k","Л":"L","л":"l","М":"M","м":"m","Н":"N","н":"n",
        "О":"O","о":"o","П":"P","п":"p","Р":"R","р":"r","С":"S","с":"s","Т":"T","т":"t",
        "У":"U","у":"u","Ф":"F","ф":"f","Х":"Kh","х":"kh","Ц":"Ts","ц":"ts","Ч":"Ch","ч":"ch",
        "Ш":"Sh","ш":"sh","Щ":"Shch","щ":"shch","Ы":"Y","ы":"y","Ъ":"Ie","ъ":"ie","Э":"E","э":"e",
        "Ю":"Iu","ю":"iu","Я":"Ia","я":"ia","Ь":"","ь":""}
inp_list = list(input("введите строку для транслитерации : "))

#накопление строки с транслитерацией
trans_str =  ""
for lett in inp_list :
    if lett in  trans_dict :
        trans_str += trans_dict[lett]
    else :
        trans_str += lett

print("Транслитерация : ",trans_str)

